{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"hero_slider_YCqTeg":{"type":"hero-slider","blocks":{"image_67Lggt":{"type":"image","settings":{"media_type":"image","image":"shopify:\/\/shop_images\/attachment_3.jpg","image_mobile":"shopify:\/\/shop_images\/attachment_3.jpg","image_overlay_opacity":75,"content_position":"middle_center","content_position_m":"bottom_left","color__info":"#f3f4f6","color__info_m":"#f3f4f6","info_align":"center","info_align_m":"left","pretitle":"","heading_size":"medium","title":"INTERNATIONAL <em>SHIPPING<\/em>","subtitle":"","subtitle_width":"","btn_label1":"","btn_url1":"","btn_label2":"","btn_url2":"","btn_color":"#f3f4f6","btn_bgcolor":"","custom_css":"p.subtitle {\n    max-width: 680px;\n}"}}},"block_order":["image_67Lggt"],"settings":{"full_width":true,"banner_height":"ratio","enable_autoslide":false,"show_pagination":false,"show_arrow":false,"margin_top":0,"margin_bottom":0,"padding_top":0,"padding_bottom":0,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":0,"padding_bottom_m":0}},"mclbx_text_grid_QhrP6L":{"type":"mclbx-text-grid","blocks":{"text_8PjAiY":{"type":"text","settings":{"title":"Shipping Policy","content":"We offer international shipping for all apparel products. Shipping costs vary based on the destination and the weight of the order. Orders may take 5-15 business days to arrive depending on the shipping method selected at checkout. Customers may be responsible for any customs duties or taxes incurred upon arrival in the destination country. To ensure timely delivery, we recommend providing accurate and complete shipping information. Tracking information will be provided once the order has been dispatched."}},"text_aCnFrd":{"type":"text","settings":{"title":"Return Policy","content":"Customers are eligible for returns on apparel products within 30 days of receiving their order. To initiate a return, please contact our customer service team with your order number and reason for return. Items must be unworn, unwashed, and in their original packaging. Shipping costs for returns will be the responsibility of the customer unless the return is due to our error. Refunds will be processed within 7-10 business days after we receive the returned item."}},"text_ARakVN":{"type":"text","settings":{"title":"International Customs","content":"When shipping apparel internationally, customs regulations may apply. Each country has its own customs policies, and it is the responsibility of the customer to be aware of these regulations prior to placing an order. Certain items may be restricted or prohibited from entering the destination country. We are not responsible for any delays or issues that arise due to customs clearance. Please check your local customs office for more information."}},"text_dLJGHp":{"type":"text","settings":{"title":"Customer Support","content":"Our customer support team is available to assist with any inquiries related to international shipping. Customers can reach us via email or through our dedicated support chat during business hours. We strive to respond to all inquiries within 24 hours. For urgent issues, please refer to our FAQ section on the website for immediate assistance."}},"text_Wpjqtn":{"type":"text","settings":{"title":"International Advertising and Analytics Services","content":"We may partner with third-party companies to display advertisements related to our international shipping services and to provide analytics. These partners may utilize cookies, web beacons, and similar technologies to gather data about your interactions with our services and other websites. This data may include your IP address, browser type, pages visited, time spent on each page, links clicked, and conversion metrics. The information collected may be used by us and our partners to analyze trends, assess the effectiveness of content, deliver targeted advertising, and enhance your online experience. For more details on interest-based advertising or to opt out of behavioral advertising, please visit www.aboutads.info\/choices."}},"text_cNnMiA":{"type":"text","settings":{"title":"Updates to Our Policy","content":"We reserve the right to modify this privacy policy at any time. When changes are made, we will update the date at the bottom of this page. We encourage users to review this page regularly to stay informed about how we protect the personal information we collect. It is your responsibility to periodically check this policy for updates."}}},"block_order":["text_8PjAiY","text_aCnFrd","text_ARakVN","text_dLJGHp","text_Wpjqtn","text_cNnMiA"],"settings":{"full_width":false,"col":1,"margin_top":0,"margin_bottom":0,"padding_top":40,"padding_bottom":80,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":32,"padding_bottom_m":32}}},"order":["main","hero_slider_YCqTeg","mclbx_text_grid_QhrP6L"]}