{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"hero_slider_U4Nthy":{"type":"hero-slider","blocks":{"image_Mxh4rc":{"type":"image","settings":{"media_type":"image","image":"shopify:\/\/shop_images\/9x16_course.png","image_overlay_opacity":80,"image_mobile":"shopify:\/\/shop_images\/9x16_course.png","image_overlay_opacity_m":100,"content_position":"bottom_left","content_position_m":"bottom_left","color__info":"#f3f4f6","color__info_m":"#f3f4f6","info_align":"left","info_align_m":"left","pretitle":"","heading_size":"medium","title":"ACCESSIBILITY STATEMENT","subtitle":"","subtitle_width":"","enable_clickable_slide":false,"clickable_slide_cta":"primary","btn_label1":"","btn_url1":"","btn_label2":"","btn_url2":"","btn_color":"#000000","btn_bgcolor":"#ffffff","custom_css":""}}},"block_order":["image_Mxh4rc"],"settings":{"full_width":true,"hide_subtitle":true,"banner_height":"custom","banner_max_height":400,"enable_autoslide":false,"show_pagination":false,"show_arrow":false,"margin_top":0,"margin_bottom":0,"padding_top":0,"padding_bottom":0,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":0,"padding_bottom_m":0}},"policy_page_Rap3cU":{"type":"policy-page","blocks":{"richtext_UDqpeF":{"type":"richtext","settings":{"richtext":"{{ page.content }}"}}},"block_order":["richtext_UDqpeF"],"disabled":true,"name":"Privacy Page","settings":{"full_width":false,"content_alignment":"left","margin_top":0,"margin_bottom":0,"padding_top":48,"padding_bottom":48,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":32,"padding_bottom_m":32}},"mclbx_text_grid_w3bLyq":{"type":"mclbx-text-grid","blocks":{"text_9VjjRX":{"type":"text","settings":{"title":"","content":"The following are the terms of use that govern consumers’ use of the bdraddy.com Website (the “Site”). Retailers are subject to different terms of use. You represent that you are: (i) at least 18 years of age; and (ii) of legal age to enter into a binding contract as determined by the laws of the State in which you reside. Your use of the Site constitutes your agreement to these terms. \n<br>\n<br>\nB.Draddy  (“B.Draddy”), reserves the right to revise these terms and conditions. We will post any changes here as they are made. Because your use of the Site following any changes constitutes your agreement to be bound by any changes, you may wish to check this section periodically.","content_rte":""}}},"block_order":["text_9VjjRX"],"disabled":true,"name":"Text Grid","settings":{"full_width":false,"col":1,"margin_top":0,"margin_bottom":0,"padding_top":40,"padding_bottom":40,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":32,"padding_bottom_m":32}},"mclbx_text_grid_Egb7Ym":{"type":"mclbx-text-grid","blocks":{"text_4FGxHq":{"type":"text","settings":{"title":"","content":"","content_rte":"<p>February 20, 2025<\/p><p>Issued by<\/p>"}},"text_njdRJU":{"type":"text","disabled":true,"settings":{"title":"PRODUCT INFORMATION","content":"B.Draddy  products displayed on the Site are available in select stores in the United States and select markets outside the United States while supplies last. In some cases, merchandise displayed for sale on the Site may not be available in all stores. The prices displayed on the Site are quoted in U.S. Dollars and are valid and effective only in the United States for purchases made through the Site.","content_rte":""}},"text_APFaLY":{"type":"text","settings":{"logo":"shopify:\/\/shop_images\/accessibe-seeklogo_1.png","title":"Compliance status","content":"","content_rte":"<p>We firmly believe that the internet should be available and accessible to anyone and are committed to providing a website that is accessible to the broadest possible audience, regardless of ability. To fulfill this, we aim to adhere as strictly as possible to the World Wide Web Consortium’s (W3C) Web Content Accessibility Guidelines 2.1 (WCAG 2.1) at the AA level. These guidelines explain how to make web content accessible to people with a wide array of disabilities. Complying with those guidelines helps us ensure that the website is accessible to blind people, people with motor impairments, visual impairment, cognitive disabilities, and more. This website utilizes various technologies that are meant to make it as accessible as possible at all times. We utilize an accessibility interface that allows persons with specific disabilities to adjust the website’s UI (user interface) and design it to their personal needs. Additionally, the website utilizes an AI-based application that runs in the background and optimizes its accessibility level constantly. This application remediates the website’s HTML, adapts its functionality and behavior for screen-readers used by blind users, and for keyboard functions used by individuals with motor impairments. If you wish to contact the website’s owner please use the following email accessibility@bdraddy.com<\/p>"}},"text_zLVqFb":{"type":"text","settings":{"title":"Screen-reader and keyboard navigation","content":"","content_rte":"<p>Our website implements the ARIA attributes (Accessible Rich Internet Applications) technique, alongside various behavioral changes, to ensure blind users visiting with screen-readers can read, comprehend, and enjoy the website’s functions. As soon as a user with a screen-reader enters your site, they immediately receive a prompt to enter the Screen-Reader Profile so they can browse and operate your site effectively. Here’s how our website covers some of the most important screen-reader requirements:<\/p><ul><li>Screen-reader optimization: we run a process that learns the website’s components from top to bottom, to ensure ongoing compliance even when updating the website. In this process, we provide screen-readers with meaningful data using the ARIA set of attributes. For example, we provide accurate form labels; descriptions for actionable icons (social media icons, search icons, cart icons, etc.); validation guidance for form inputs; element roles such as buttons, menus, modal dialogues (popups), and others. Additionally, the background process scans all of the website’s images. It provides an accurate and meaningful image-object-recognition-based description as an ALT (alternate text) tag for images that are not described. It will also extract texts embedded within the image using an OCR (optical character recognition) technology. To turn on screen-reader adjustments at any time, users need only to press the Alt+1 keyboard combination. Screen-reader users also get automatic announcements to turn the Screen-reader mode on as soon as they enter the website. These adjustments are compatible with popular screen readers such as JAWS, NVDA, VoiceOver, and TalkBack.<\/li><li>Keyboard navigation optimization: The background process also adjusts the website’s HTML and adds various behaviors using JavaScript code to make the website operable by the keyboard. This includes the ability to navigate the website using the Tab and Shift+Tab keys, operate dropdowns with the arrow keys, close them with Esc, trigger buttons and links using the Enter key, navigate between radio and checkbox elements using the arrow keys, and fill them in with the Spacebar or Enter key. Additionally, keyboard users will find content-skip menus available at any time by clicking Alt+2, or as the first element of the site while navigating with the keyboard. The background process also handles triggered popups by moving the keyboard focus towards them as soon as they appear, not allowing the focus to drift outside. Users can also use shortcuts such as “M” (menus), “H” (headings), “F” (forms), “B” (buttons), and “G” (graphics) to jump to specific elements.<\/li><\/ul>"}},"text_f9FDiC":{"type":"text","settings":{"title":"Disability profiles supported on our website","content":"","content_rte":"<ul><li>Epilepsy Safe Profile: this profile enables people with epilepsy to safely use the website by eliminating the risk of seizures resulting from flashing or blinking animations and risky color combinations.<\/li><li>Vision Impaired Profile: this profile adjusts the website so that it is accessible to the majority of visual impairments such as Degrading Eyesight, Tunnel Vision, Cataract, Glaucoma, and others.<\/li><li>Cognitive Disability Profile: this profile provides various assistive features to help users with cognitive disabilities such as Autism, Dyslexia, CVA, and others, to focus on the essential elements more easily.<\/li><li>ADHD Friendly Profile: this profile significantly reduces distractions and noise to help people with ADHD, and Neurodevelopmental disorders browse, read, and focus on the essential elements more easily.<\/li><li>Blind Users Profile (Screen-readers): this profile adjusts the website to be compatible with screen-readers such as JAWS, NVDA, VoiceOver, and TalkBack. A screen-reader is installed on the blind user’s computer, and this site is compatible with it.<\/li><li>Keyboard Navigation Profile (Motor-Impaired): this profile enables motor-impaired persons to operate the website using the keyboard Tab, Shift+Tab, and the Enter keys. Users can also use shortcuts such as “M” (menus), “H” (headings), “F” (forms), “B” (buttons), and “G” (graphics) to jump to specific elements.<\/li><\/ul>"}},"text_r9zPrt":{"type":"text","settings":{"title":"Additional UI, design, and readability adjustments","content":"","content_rte":"<ul><li>Font adjustments users can increase and decrease its size, change its family (type), adjust the spacing, alignment, line height, and more.<\/li><li>Color adjustments users can select various color contrast profiles such as light, dark, inverted, and monochrome. Additionally, users can swap color schemes of titles, texts, and backgrounds with over seven different coloring options.<\/li><li>Animations epileptic users can stop all running animations with the click of a button. Animations controlled by the interface include videos, GIFs, and CSS flashing transitions.<\/li><li>Content highlighting users can choose to emphasize essential elements such as links and titles. They can also choose to highlight focused or hovered elements only.<\/li><li>Audio muting users with hearing devices may experience headaches or other issues due to automatic audio playing. This option lets users mute the entire website instantly.<\/li><li>Cognitive disorders we utilize a search engine linked to Wikipedia and Wiktionary, allowing people with cognitive disorders to decipher meanings of phrases, initials, slang, and others.<\/li><li>Additional functions we allow users to change cursor color and size, use a printing mode, enable a virtual keyboard, and many other functions.<\/li><\/ul>"}},"text_DLepdP":{"type":"text","settings":{"title":"Assistive technology and browser compatibility","content":"We aim to support as many browsers and assistive technologies as possible, so our users can choose the best fitting tools for them, with as few limitations as possible. Therefore, we have worked very hard to be able to support all major systems that comprise over 95% of the user market share, including Google Chrome, Mozilla Firefox, Apple Safari, Opera and Microsoft Edge, JAWS, and NVDA (screen readers), both for Windows and MAC users.","content_rte":""}},"text_HFgGzq":{"type":"text","settings":{"title":"Notes, comments, and feedback","content":"Despite our very best efforts to allow anybody to adjust the website to their needs, there may still be pages or sections that are not fully accessible, are in the process of becoming accessible, or are lacking an adequate technological solution to make them accessible. Still, we are continually improving our accessibility, adding, updating, improving its options and features, and developing and adopting new technologies. All this is meant to reach the optimal level of accessibility following technological advancements. If you wish to contact the website’s owner, please use the following email accessibility@bdraddy.com","content_rte":""}},"text_hjgVkj":{"type":"text","disabled":true,"settings":{"title":"PRIVACY POLICY","content":"You agree that B.Draddy  may use and\/or disclose information consistent with our Privacy Policy.","content_rte":""}},"text_gUW3Ub":{"type":"text","disabled":true,"settings":{"title":"INDEMNIFICATION","content":"You agree to defend, indemnify and hold B.Draddy  harmless from and against any and all claims, damages, costs and expenses, including attorneys’ fees, arising from or related to your use of the Site.","content_rte":""}},"text_VicyL3":{"type":"text","disabled":true,"settings":{"title":"Links to other web sites","content":"To the extent that this Site contains links to services and resources not within B.Draddy ’s control (“Third-Party Sources”), any claims or concerns regarding any Third-Party Sources, or any link thereto, should be directed to the particular Third-Party Source. You agree that B.Draddy  shall not be liable to you for your use of any Third-Party Sources.","content_rte":""}}},"block_order":["text_4FGxHq","text_njdRJU","text_APFaLY","text_zLVqFb","text_f9FDiC","text_r9zPrt","text_DLepdP","text_HFgGzq","text_hjgVkj","text_gUW3Ub","text_VicyL3"],"name":"Text Grid","settings":{"full_width":false,"col":1,"margin_top":0,"margin_bottom":0,"padding_top":40,"padding_bottom":40,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":32,"padding_bottom_m":32}},"rich_text_AxtWBX":{"type":"rich-text","blocks":{"heading_neayWi":{"type":"heading","settings":{"heading":"Advertising and Analytics Services Provided by Others","heading_size":"h2"}}},"block_order":["heading_neayWi"],"disabled":true,"name":"t:sections.rich-text.presets.name","settings":{"desktop_content_position":"left","content_alignment":"left","full_width":true,"padding_top":40,"padding_bottom":24}},"mclbx_text_grid_pjdjLJ":{"type":"mclbx-text-grid","blocks":{"text_VrEdxT":{"type":"text","settings":{"title":"","content":"We may allow others to serve advertisements on our behalf across the Internet and to provide analytics services. These entities may use cookies, web beacons and other technologies to collect information about your use of the Services and other websites, including your IP address, web browser, pages viewed, time spent on pages, links clicked and conversion information. This information may be used by Company and others to, among other things, analyze and track data, determine the popularity of certain content, deliver advertising and content targeted to your interests on our Services and other websites and better understand your online activity. For more information about interest-based ads, or to opt out of having your web browsing information used for behavioral advertising purposes by companies that participate in the Digital Advertising Alliance, please visit www.aboutads.info\/choices.","content_rte":""}},"text_aL9NmU":{"type":"text","settings":{"title":"Security","content":"We adopt appropriate data collection, storage and processing practices and security measures to protect against unauthorized access, alteration, disclosure or destruction of your personal information, username, password, transaction information and data stored on our Site. Sensitive and private data exchange between the Site and its Users happens over a SSL secured communication channel and is encrypted and protected with digital signatures.","content_rte":""}},"text_h7pJUh":{"type":"text","settings":{"title":"Children","content":"Protecting the privacy of the very young is especially important. For that reason, we never collect or maintain information at our Site from those we actually know are under 13, and no part of our website is structured to attract anyone under 13.","content_rte":""}},"text_Ta74YP":{"type":"text","settings":{"title":"Changes to this privacy policy","content":"Summit Golf Brands has the discretion to update this privacy policy at any time. When we do, revise the updated date at the bottom of this page. We encourage Users to frequently check this page for any changes to stay informed about how we are helping to protect the personal information we collect. You acknowledge and agree that it is your responsibility to review this privacy policy periodically and become aware of modifications.","content_rte":""}}},"block_order":["text_VrEdxT","text_aL9NmU","text_h7pJUh","text_Ta74YP"],"disabled":true,"name":"Text Grid","settings":{"full_width":false,"col":1,"margin_top":0,"margin_bottom":0,"padding_top":0,"padding_bottom":40,"margin_top_m":0,"margin_bottom_m":0,"padding_top_m":0,"padding_bottom_m":32}}},"order":["main","hero_slider_U4Nthy","policy_page_Rap3cU","mclbx_text_grid_w3bLyq","mclbx_text_grid_Egb7Ym","rich_text_AxtWBX","mclbx_text_grid_pjdjLJ"]}